MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/inc/hc32f46x_clk.h
    /**
     *******************************************************************************
     ** \brief  Configuration structure of fcm measurement.
     **
     ** \note   Configures the fcm measurement if needed.
     **
     ******************************************************************************/
    typedef struct stc_clk_fcm_measure_cfg
    {
        en_clk_fcm_measure_source_t enSrc;        ///< The measurement source.
        en_clk_fcm_measure_div_factor_t enSrcDiv; ///< The division factor of measurement source.
    } stc_clk_fcm_measure_cfg_t;

    /**
     *******************************************************************************
     ** \brief  Configuration structure of fcm reference.
     **
     ** \note   Configures the fcm reference if needed.
     **
     ******************************************************************************/
    typedef struct stc_clk_fcm_reference_cfg
    {
        en_functional_state_t enExtRef;             ///< Enable external reference or not.
        en_clk_fcm_edge_t enEdge;                   ///< The edge of internal reference.
        en_clk_fcm_filter_clk_t enFilterClk;        ///< The filter clock of internal reference.
        en_clk_fcm_refer_t enRefSel;                ///< Select reference.
        en_clk_fcm_intref_source_t enIntRefSrc;     ///< Select internal reference.
        en_clk_fcm_intref_div_factor_t enIntRefDiv; ///< The division factor of internal reference.
    } stc_clk_fcm_reference_cfg_t;

    /**
     *******************************************************************************
     ** \brief  Configuration structure of fcm interrupt.
     **
     ** \note   Configures the fcm interrupt if needed.
     **
     ******************************************************************************/
    typedef struct stc_clk_fcm_interrupt_cfg
    {
        en_clk_fcm_abnormal_handle_t enHandleSel; ///< Use interrupt or reset.
        en_functional_state_t enHandleReset;      ///< Enable reset or not.
        en_functional_state_t enHandleInterrupt;  ///< Enable interrupt or not.
        en_functional_state_t enOvfInterrupt;     ///< Enable overflow interrupt or not.
        en_functional_state_t enEndInterrupt;     ///< Enable measurement end interrupt or not.
    } stc_clk_fcm_interrupt_cfg_t;

    /**
     *******************************************************************************
     ** \brief  Configuration structure of fcm.
     **
     ** \note   Configures the fcm if needed.
     **
     ******************************************************************************/
    typedef struct stc_clk_fcm_cfg
    {
        stc_clk_fcm_window_cfg_t *pstcFcmWindowCfg; ///< Window configuration struct.
        stc_clk_fcm_measure_cfg_t *pstcFcmMeaCfg;   ///< Measurement configuration struct.
        stc_clk_fcm_reference_cfg_t *pstcFcmRefCfg; ///< Reference configuration struct.
        stc_clk_fcm_interrupt_cfg_t *pstcFcmIntCfg; ///< Interrupt configuration struct.
    } stc_clk_fcm_cfg_t;

    /**
     *******************************************************************************
     ** \brief  Clock frequency structure.
     **
     ******************************************************************************/
    typedef struct stc_clk_freq
    {
        uint32_t sysclkFreq; ///< System clock frequency.
        uint32_t hclkFreq;   ///< Hclk frequency.
        uint32_t exckFreq;   ///< Exclk frequency.
        uint32_t pclk0Freq;  ///< Pclk0 frequency.
        uint32_t pclk1Freq;  ///< Pclk1 frequency.
        uint32_t pclk2Freq;  ///< Pclk2 frequency.
        uint32_t pclk3Freq;  ///< Pclk3 frequency.
        uint32_t pclk4Freq;  ///< Pclk4 frequency.
    } stc_clk_freq_t;

    /**
     *******************************************************************************
     ** \brief  PLL Clock frequency structure.
     **
     ******************************************************************************/
    typedef struct stc_pll_clk_freq
    {
        uint32_t mpllp; ///< mpllp clock frequency.
        uint32_t mpllq; ///< mpllq clock frequency.
        uint32_t mpllr; ///< mpllr clock frequency.
        uint32_t upllp; ///< upllp clock frequency.
        uint32_t upllq; ///< upllq clock frequency.
        uint32_t upllr; ///< upllr clock frequency.
    } stc_pll_clk_freq_t;

    /*******************************************************************************
     * Global pre-processor symbols/macros ('#define')
     ******************************************************************************/

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
     * Global function prototypes (definition in C source)
     ******************************************************************************/
    void CLK_XtalConfig(const stc_clk_xtal_cfg_t *pstcXtalCfg);
    void CLK_XtalStbConfig(const en_clk_xtal_stb_cycle_t enXtalStb);
    void CLK_XtalStpConfig(const stc_clk_xtal_stp_cfg_t *pstcXtalStpCfg);
    en_result_t CLK_XtalCmd(en_functional_state_t enNewState);

    void CLK_Xtal32Config(const stc_clk_xtal32_cfg_t *pstcXtal32Cfg);
    en_result_t CLK_Xtal32Cmd(en_functional_state_t enNewState);

    void CLK_HrcTrim(int8_t trimValue);
    en_result_t CLK_HrcCmd(en_functional_state_t enNewState);

    void CLK_MrcTrim(int8_t trimValue);
    en_result_t CLK_MrcCmd(en_functional_state_t enNewState);

    void CLK_LrcTrim(int8_t trimValue);
    en_result_t CLK_LrcCmd(en_functional_state_t enNewState);

    void CLK_SetPllSource(en_clk_pll_source_t enPllSrc);
    void CLK_MpllConfig(const stc_clk_mpll_cfg_t *pstcMpllCfg);
    en_result_t CLK_MpllCmd(en_functional_state_t enNewState);

    void CLK_UpllConfig(const stc_clk_upll_cfg_t *pstcUpllCfg);
    en_result_t CLK_UpllCmd(en_functional_state_t enNewState);

    void CLK_SetSysClkSource(en_clk_sys_source_t enTargetSysSrc);
    en_clk_sys_source_t CLK_GetSysClkSource(void);

    void CLK_SysClkConfig(const stc_clk_sysclk_cfg_t *pstcSysclkCfg);
    void CLK_GetClockFreq(stc_clk_freq_t *pstcClkFreq);
    void CLK_GetPllClockFreq(stc_pll_clk_freq_t *pstcPllClkFreq);

    void CLK_SetUsbClkSource(en_clk_usb_source_t enTargetUsbSrc);
    void CLK_SetPeriClkSource(en_clk_peri_source_t enTargetPeriSrc);
    void CLK_SetI2sClkSource(const M4_I2S_TypeDef *pstcI2sReg, en_clk_peri_source_t enTargetPeriSrc);
    en_clk_peri_source_t CLK_GetI2sClkSource(const M4_I2S_TypeDef *pstcI2sReg);

    void CLK_TpiuClkConfig(const en_clk_tpiuclk_div_factor_t enTpiuDiv);
    void CLK_TpiuClkCmd(en_functional_state_t enNewState);

    void CLK_OutputClkConfig(en_clk_output_ch_t enCh, const stc_clk_output_cfg_t *pstcOutputCfg);
    void CLK_OutputClkCmd(en_clk_output_ch_t enCh, en_functional_state_t enNewState);
    en_flag_status_t CLK_GetFlagStatus(en_clk_flag_t enClkFlag);

    void CLK_FcmConfig(const stc_clk_fcm_cfg_t *pstcClkFcmCfg);
    void CLK_FcmCmd(en_functional_state_t enNewState);

    uint16_t CLK_GetFcmCounter(void);
    en_flag_status_t CLK_GetFcmFlag(en_clk_fcm_flag_t enFcmFlag);
    void CLK_ClearFcmFlag(en_clk_fcm_flag_t enFcmFlag);

    void CLK_ClearXtalStdFlag(void);

    //@} // CmuGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_CLK_ENABLE */

#endif /* __HC32F46X_CLK_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
